app/controllers/articles_controller.rb

def create
  @article = Article.new(article_params)
  @article.poster = params[:article][:poster]

  if @article.save
---
INSERT INTO "articles" ("title", "body", "poster", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "stars upon the sky"], ["body", "Beautiful night on the mountain pic."], ["poster", "111.jpg"], ["created_at", "2017-05-28 05:58:11.373971"], ["updated_at", "2017-05-28 05:58:11.373971"]]

def update
  @article = Article.find(params[:id])

  if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "articles" SET "body" = $1, "poster" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["body", "photo has been upload successfully"], ["poster", "1615.jpg"], ["updated_at", "2017-05-28 05:34:31.255271"], ["id", 2]]