app/controllers/comments_controller.rb

 def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "Max"], ["body", "laskhfkjahsk"], ["article_id", 1], ["created_at", "2017-05-21 03:06:47.748005"], ["updated_at", "2017-05-21 03:06:47.748005"]]