app/controllers/events_controller.rb

def create
  @event = Event.new(event_params)
  if @event.save
---
INSERT INTO "events" ("name", "description", "location", "location_frame", "start_time", "finish_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

def update
  @event = Event.find(params[:id])

  if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "events" SET "description" = $1, "start_time" = $2, "finish_time" = $3, "updated_at" = $4 WHERE "events"."id" = $5  [["description", "hggffggffggffggfgf"], ["start_time", "2017-06-10 03:02:00.000000"], ["finish_time", "2017-06-10 03:02:00.000000"], ["updated_at", "2017-06-10 03:02:45.853219"], ["id", 1]]