app/controllers/photo_galleries_controller.rb

SELECT  "photo_galleries".* FROM "photo_galleries" LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "photo_galleries"
---
def index
    @photo_galleries = PhotoGallery.paginate(:page => params[:page], :per_page => 3)

SELECT  "photo_galleries".* FROM "photo_galleries" WHERE "photo_galleries"."id" = $1 LIMIT 1  [["id", 0]]
---
def show
    @photo_gallery = PhotoGallery.find(params[:id])

INSERT INTO "photo_galleries" ("name", "describtion", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["describtion", "d;ogj.;ksjhgadkgfsdklh"], ["created_at", "2017-05-28 08:38:12.961175"], ["updated_at", "2017-05-28 08:38:12.961175"]]
---
def create
  @photo_gallery = PhotoGallery.new(photo_gallery_params)
  #@photo_gallery.pictures = params[:photo_gallery][:pictures]

  if @photo_gallery.save

SELECT  "photo_galleries".* FROM "photo_galleries" WHERE "photo_galleries"."id" = $1 LIMIT 1  [["id", 0]]
---
def edit
  @photo_gallery = PhotoGallery.find(params[:id])

SELECT  "photo_galleries".* FROM "photo_galleries" WHERE "photo_galleries"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "photo_galleries" SET "pictures" = $1, "updated_at" = $2 WHERE "photo_galleries"."id" = $3  [["pictures", "[\"111.jpg\", \"1615.jpg\", \"1648.jpg\"]"], ["updated_at", "2017-05-28 09:29:56.280098"], ["id", 4]]
---
def update
  @photo_gallery = PhotoGallery.find(params[:id])

  if @photo_gallery.update(photo_gallery_params)

SELECT  "photo_galleries".* FROM "photo_galleries" WHERE "photo_galleries"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "photo_galleries" WHERE "photo_galleries"."id" = $1  [["id", 5]]
---
def destroy
  @photo_gallery = PhotoGallery.find(params[:id])
  @photo_gallery.destroy