app/controllers/video_galleries_controller.rb

  def index
    @video_galleries = VideoGallery.all
---
SELECT "video_galleries".* FROM "video_galleries"

  def show
    @video_gallery = VideoGallery.find(params[:id])
---
SELECT  "video_galleries".* FROM "video_galleries" WHERE "video_galleries"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @video_gallery = VideoGallery.find(params[:id])
---
SELECT  "video_galleries".* FROM "video_galleries" WHERE "video_galleries"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @video_gallery = VideoGallery.new(video_gallery_params)

    respond_to do |format|
      if @video_gallery.save
---
INSERT INTO "video_galleries" ("name", "describtion", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "wow))"], ["describtion", "its amazing"], ["created_at", "2017-06-15 23:46:02.043666"], ["updated_at", "2017-06-15 23:46:02.043666"]]

  def update
    respond_to do |format|
      if @video_gallery.update(video_gallery_params)
---
UPDATE "video_galleries" SET "attachment_file_name" = $1, "attachment_content_type" = $2, "attachment_file_size" = $3, "attachment_updated_at" = $4, "updated_at" = $5 WHERE "video_galleries"."id" = $6

  def destroy
    @video_gallery.destroy
---
DELETE FROM "video_galleries" WHERE "video_galleries"."id" = $1  [["id", 1]]

    def set_video_gallery
      @video_gallery = VideoGallery.find(params[:id])
---
SELECT  "video_galleries".* FROM "video_galleries" WHERE "video_galleries"."id" = $1 LIMIT 1  [["id", 1]]